Revit 2027 API
RebarContainerItem.GetTerminationOrientation Method
 Gets the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarTerminationOrientation GetTerminationOrientation(
	int end
)
Public Function GetTerminationOrientation (
	end As Integer
) As RebarTerminationOrientation
public:
RebarTerminationOrientation GetTerminationOrientation(
	int end
)
member GetTerminationOrientation :
        end : int -> RebarTerminationOrientation
Parameters
end Int32
 0 for the start hook, 1 for the end hook.
Return Value
RebarTerminationOrientation
Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace